Tekla Open API Reference for Tekla Structures 2025
Polyline Constructor
Overload List
Name | Description
Polyline(ViewBase, PointList)
 Creates a new polyline instance with the point list using standard attributes.
Polyline(ViewBase, PointList, Polyline.PolylineAttributes)
 Creates a new polyline instance with the point list using the given attributes.
Top
See Also
Reference
Polyline Class
Tekla.Structures.Drawing Namespace